kushuninan-git/stm32f103zet6RTOS/user/main.c
/* 标准库头文件 */
#include "stdio.h"
#include "string.h"
#include "time.h"

/* STM32标准外设库 */
#include "stm32f10x.h"
#include "stm32f10x_it.h"

/* FreeRTOS相关 */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include "event_groups.h"
#include "timers.h"

/* 用户自定义头文件 */
#include "main.h"
#include "delay.h"

/* 硬件驱动 */
#include "key.h"
#include "led.h"
#include "lcd.h"
#include "usart1.h"
#include "esp8266.h"
#include "dht11.h"
#include "light.h"
#include "kqm.h"
#include "su_03t.h"
#include "rtc.h"
#include "Myi2c_bh1750.h"
#include "flash.h"
#include "bsp_lcd.h"
#include "jx_uart_send.h"
#include "lvgl.h"
#include "lv_port_disp.h"
#include "tim.h"

/* 注释掉的头文件 */
// #include "bh1750.h"
// #include "stm32_eval_spi_flash.h"
// #include "zi.h"

// lvgl文件
#include "gui_guider.h"
#include "lvgl.h"
#include "lv_port_disp.h"

// 句柄
TaskHandle_t Led1TaskHandle = NULL;
TaskHandle_t Led2TaskHandle = NULL;
TaskHandle_t Led3TaskHandle = NULL;
TaskHandle_t Led4TaskHandle = NULL;
TaskHandle_t KeyTaskHandle = NULL;
TaskHandle_t RTC_TaskHandle = NULL;
TaskHandle_t Dht11TaskHandle = NULL;
TaskHandle_t KqmTaskHandle = NULL;
TaskHandle_t LightTaskHandle = NULL;
TaskHandle_t Bh1750TaskHandle = NULL;
TaskHandle_t LCDTaskHandle = NULL;
TaskHandle_t WifiTaskHandle = NULL;
TaskHandle_t LVGLTaskHandle = NULL;
// 消息队列
QueueHandle_t xQueue1 = NULL;
// 信号量
SemaphoreHandle_t xSemaphore1 = NULL;
// 事件组
EventGroupHandle_t myevent_group = NULL;
// 软件定时器
TimerHandle_t xTimer1 = NULL;
TimerHandle_t wifitimer = NULL;
TimerHandle_t aptimer = NULL;
#define BIT_0 (1 << 0) // 状态
#define BIT_4 (1 << 4)
#define BIT_6 (1 << 6)
// LED任务
void LED1Task(void *pvParameters)
{
    Led_Init(); // 初始化LED
    for (;;)
    {
        // 获取事件组当前所有状态位的快照
        // BIT_0: 布防标志 (KEY1置位, KEY2清除)
        // BIT_4|BIT_6: 传感器报警标志
        EventBits_t uxBits = xEventGroupWaitBits(myevent_group,
                                                 BIT_0 | BIT_4 | BIT_6,
                                                 pdFALSE, // 退出时不清除任何位
                                                 pdFALSE, // 等待任意位 (这里主要为了读取状态)
                                                 100);    // 轮询周期100ms

        // 核心逻辑：先检查是否处于布防状态 (BIT_0)
        if ((uxBits & BIT_0) != 0)
        {
            // 已布防：根据传感器状态决定亮灭
            // 必须 BIT_4 和 BIT_6 同时满足才报警
            if ((uxBits & (BIT_4 | BIT_6)) == (BIT_4 | BIT_6))
            {
                LED1_ON(); // 报警：环境恶劣且已布防
                // printf("ALARM ON! Bits: %X\n", uxBits);
            }
            else
            {
                LED1_OFF(); // 正常：环境良好
                // printf("Normal. Bits: %X\n", uxBits);
            }
        }
        else
        {
            // 未布防 (BIT_0被KEY2清除)：强制灭灯
            LED1_OFF();
            // printf("Disarmed. Bits: %X\n", uxBits);
        }
    }
}
// LED2任务
void LED2Task(void *pvParameters)
{
    for (;;)
    {
        LED2_ON();
        vTaskDelay(400);
        LED2_OFF();
        vTaskDelay(400);
    }
}
// LED3任务
void LED3Task(void *pvParameters)
{
    for (;;)
    {
        LED3_ON();
        vTaskDelay(300);
        LED3_OFF();
        vTaskDelay(300);
    }
}
// LED4任务
void LED4Task(void *pvParameters)
{
    for (;;)
    {
        LED4_ON();
        vTaskDelay(200);
        LED4_OFF();
        vTaskDelay(200);
    }
}
// key任务

void KeyTask(void *pvParameters)
{
    KEY_Init(); // 初始化按键
    uint8_t Keyflage = 0;
    // 切换lcgl界面计数
    uint8_t lvgl_comunt = 1;
    for (;;)
    {
        vTaskDelay(10);
        Keyflage = KEY_Scan();
        if (Keyflage == KEY1_PRESS)
        {
            printf("KEY1 Pressed! Arming...\r\n");
            // 当KEY1按下时,设置事件组BIT_0
            xEventGroupSetBits(myevent_group, 0x01);
        }
        else if (Keyflage == KEY2_PRESS)
        {
            printf("KEY2 Pressed! Disarming...\r\n");
            // 当KEY2按下时,清除事件组BIT_0
            xEventGroupClearBits(myevent_group, 0x01);
        }
        if (Keyflage == KEY3_PRESS)
        {
            lvgl_comunt++;
            if (lvgl_comunt > 2)
            {
                lvgl_comunt = 1;
            }
            if (lvgl_comunt == 1)
            {
                lv_scr_load(guider_ui.screen_open);
            }
            else if (lvgl_comunt == 2)
            {
                lv_scr_load(guider_ui.screen_data);
            }
        }
        else if (Keyflage == KEY4_PRESS)
        {
            esp.state = 1;
            lv_scr_load(guider_ui.screen_wifi);
            printf("ap模式 \r\n");
        }
        vTaskDelay(10);
    }
}
// RTC时间更新任务
void RTC_Task(void *pvParameters)
{
    RTC_Init(); // 初始化RTC
    SENSORDATA sensor_data = {0};
    for (;;)
    {
        RTC_GetTime(); // 更新RTC时间
        sensor_data.rtcdata[0] = info->tm_year + 1900;
        sensor_data.rtcdata[1] = info->tm_mon + 1;
        sensor_data.rtcdata[2] = info->tm_mday;
        sensor_data.rtcdata[3] = info->tm_hour;
        sensor_data.rtcdata[4] = info->tm_min;
        sensor_data.rtcdata[5] = info->tm_sec;
        sensor_data.rtcdata[6] = info->tm_wday;
        sensor_data.id = SENSOR_ID_RTC;
        xQueueSend(xQueue1, &sensor_data, portMAX_DELAY);
        vTaskDelay(1000);
    }
}
// DHt11数据读取任务
void Dht11Task(void *pvParameters)
{
    Dht11_Init(); // 初始化DHT11温湿度传感器
    SENSORDATA sensor_data = {0};
    for (;;)
    {
        // 进入临界区
        taskENTER_CRITICAL();
        Dht11_ReadData(); // 读取DHT11温湿度传感器数据
        // 退出临界区
        taskEXIT_CRITICAL();
        sensor_data.dht11data[0] = dht.tem;
        sensor_data.dht11data[1] = dht.hum;
        sensor_data.id = SENSOR_ID_DHT11;
        // 发送到消息队列,一直等待直到发送成功
        xQueueSend(xQueue1, &sensor_data, portMAX_DELAY);
        // 节拍2秒读取一次
        vTaskDelay(2000);
    }
}
// kqm数据读取任务
void KqmTask(void *pvParameters)
{
    Kqm_Init(); // 初始化空气质量传感器
    SENSORDATA sensor_data = {0};
    for (;;)
    {
        // 等待信号量,如果没有信号量,则等待
        xSemaphoreTake(xSemaphore1, portMAX_DELAY);
        Kqm_ReadData(); // 读取空气质量传感器数据
        sensor_data.kqmdata[0] = kqm.co2;
        sensor_data.kqmdata[1] = kqm.ch2o;
        sensor_data.kqmdata[2] = kqm.voc;
        sensor_data.id = SENSOR_ID_KQM;
        // 发送到消息队列,一直等待直到发送成功
        xQueueSend(xQueue1, &sensor_data, portMAX_DELAY);
        // printf("kqmdata: %.2f, %.2f, %.2f\n", sensor_data.kqmdata[0], sensor_data.kqmdata[1], sensor_data.kqmdata[2]);
        if (sensor_data.kqmdata[0] > 380)
        {
            /* code */
            // 当CO2浓度大于380时,设置事件组BIT_6
            xEventGroupSetBits(myevent_group, BIT_6);
        }
        else
        {
            // 当CO2浓度小于等于380时,清除事件组BIT_6
            xEventGroupClearBits(myevent_group, BIT_6);
        }
        if (sensor_data.kqmdata[2] > 0.5)
        {
            /* code */
            // 当VOC浓度大于380时,设置事件组BIT_6
            xEventGroupSetBits(myevent_group, BIT_4);
        }
        else
        {
            // 当VOC浓度小于等于380时,清除事件组BIT_6
            xEventGroupClearBits(myevent_group, BIT_4);
        }

        // 消息队列等待100ms
        // xQueueReceive(xQueue1, &sensor_data, 100);
        // Kqm_Debug(); // 打印空气质量数据
        // vTaskDelay(2000); // 500ms读取一次
    }
}
// 光照数据读取
void LightTask(void *pvParameters)
{
    Light_Init(); // 初始化光照传感器
    SENSORDATA sensor_data = {0};
    for (;;)
    {
        Light_ReadData(); // 读取光照传感器数据
        sensor_data.lightdata[0] = addbuff[1];
        sensor_data.lightdata[1] = addbuff[2];
        sensor_data.id = SENSOR_ID_LIGHT;
        // 发送到消息队列,一直等待直到发送成功
        xQueueSend(xQueue1, &sensor_data, portMAX_DELAY);
        // 消息队列等待100ms
        // xQueueReceive(xQueue1, &sensor_data, 100);
        // Light_Debug(); // 打印光照数据
        vTaskDelay(2000); // 2秒读取一次
    }
}
// bh1750数据读取任务
void Bh1750Task(void *pvParameters)
{
    // BH1750_I2C1_Init();    // 硬件初始化BH1750光照传感器
    BH1750_SoftI2C_Init(); // 软件初始化BH1750的I2C接口
    BH1750_Sensor_Init();  // 初始化BH1750传感器
    SENSORDATA sensor_data = {0};
    uint8_t debug_counter = 0;
    for (;;)
    {
        // 进入临界区
        taskENTER_CRITICAL();
        sensor_data.bh1750data = BH1750_Sensor_ReadLight(); // 读取BH1750传感器数据（已增强）
        // 退出临界区
        taskEXIT_CRITICAL();
        sensor_data.id = SENSOR_ID_BH1750;
        // 发送到消息队列,一直等待直到发送成功
        xQueueSend(xQueue1, &sensor_data, portMAX_DELAY);

