kushuninan-git/stm32f103zet6RTOS/user/main.c
        // // 每5次读取打印一次增强调试信息
        // if (++debug_counter >= 5)
        // {
        //     BH1750_Debug(); // 打印增强的BH1750数据
        //     debug_counter = 0;
        // }

        vTaskDelay(1000); // 1秒读取一次（更频繁）
    }
}
// LCD任务
void LCDTask(void *pvParameters)
{
    // LCD_Init();    // 初始化LCD
    // LCD_UI_Init(); // 初始化LCD UI界面
    SENSORDATA sensor_data = {0};
    for (;;)
    {
        // 从消息队列接收数据,一直等待直到接收成功
        xQueueReceive(xQueue1, &sensor_data, portMAX_DELAY);
        // 根据传感器ID更新LCD数据
        switch (sensor_data.id)
        {
        case SENSOR_ID_DHT11:
            //  printf("tem: %.1f hum: %.1f\n", sensor_data.dht11data[0], sensor_data.dht11data[1]);

            break;
        case SENSOR_ID_KQM:
            // printf("KQM: co2: %.2f ch2o: %.2f voc: %.2f\n", sensor_data.kqmdata[0], sensor_data.kqmdata[1], sensor_data.kqmdata[2]);
            break;
        case SENSOR_ID_LIGHT:
            // printf("light: %04d, yanwu: %04d\n", sensor_data.lightdata[0], sensor_data.lightdata[1]);
            break;
        case SENSOR_ID_BH1750:
            // printf("BH1750: %.1f lx \n", sensor_data.bh1750data);
            break;
        case SENSOR_ID_RTC:
            // printf("RTC: %04d, %02d, %02d, %02d, %02d, %02d, %d\n", sensor_data.rtcdata[0], sensor_data.rtcdata[1], sensor_data.rtcdata[2], sensor_data.rtcdata[3], sensor_data.rtcdata[4], sensor_data.rtcdata[5], sensor_data.rtcdata[6]);
            break;
        default:
            break;
        }
    }
}
// wifi任务
void WifiTask(void *pvParameters)
{
    Flash_Init();
    Uart3_Init();
    for (;;)
    {
        vTaskDelay(100);
        if (esp.state == 1)
        {
            ESP_AP();
        }
        else if (esp.state >= 2)
        {
            UpDataYun();
        }
        else if (esp.state == 5)
        {
            YunDataHandle();
        }
    }
}
// lvgl任务
void LVGLTask(void *pvParameters)
{

    while (1)
    {
        lv_task_handler();
        vTaskDelay(100);
    }
}

// 定时器回调函数
void vTimerCallback(TimerHandle_t xTimer)
{
    // 获取定时器ID
    uint32_t ulCount = (uint32_t)pvTimerGetTimerID(xTimer);
    // printf("Timer ID: %d\n", ulCount);
}
// WIFI回调函数
void wifibackFunction(TimerHandle_t xTimer)
{
    static uint8_t num = 0;
    uint32_t ulCount = (uint32_t)pvTimerGetTimerID(xTimer);
    if (ulCount == 2)
    {
        if (esp.state == 0)
        {
            num++;
            if (num >= 5)
            {
                esp.state = 2;
                printf("选择sta模式\r\n");
            }
        }
    }
    if (esp.state == 5)
        MQTT_REQ();
}
// 任务状态显示定时器回调函数
uint8_t CPU_RunInfo[400] = {0};
void vCallbackFunction(TimerHandle_t xTimer)
{
    memset(CPU_RunInfo, 0, 400);
    vTaskList((char *)&CPU_RunInfo);
    printf("---------------------------------------------\r\n");
    printf("任务名 任务状态 优先级 任务序号\r\n");
    printf("%s", CPU_RunInfo);
    printf("---------------------------------------------\r\n");
}
int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); // 中断分组2（2位抢占+2位子优先级）
    USART1_Init();                                  // 初始化串口1
    TIM_Init();                                     // 初始化定时器

    lv_init();           // 初始化lvgl
    lv_port_disp_init(); // 初始化lvgl显示接口

    setup_scr_screen_open(&guider_ui);  // 初始化打开界面
    lv_scr_load(guider_ui.screen_open); // 加载欢迎界面
    setup_scr_screen_data(&guider_ui);  // 初始化数据界面
    setup_scr_screen_wifi(&guider_ui);  // 初始化wifi界面

    // 创建队列，用于存储传感器数据，队列长度为5，每个元素大小为SENSORDATA结构体大小
    xQueue1 = xQueueCreate(5, sizeof(SENSORDATA));
    //    // 创建信号量
    //    xSemaphore1 = xSemaphoreCreateBinary();
    //    // 创建事件组
    //    myevent_group = xEventGroupCreate();
    //    // 创建软件定时器
    //    xTimer1 = xTimerCreate(
    //        "Timer1",        // 定时器名称
    //        1000,            // 定时器周期，单位为系统时钟周期数（1000ms）
    //        pdTRUE,          // 自动重装载模式
    //        (void *)0,       // 传递给定时器回调函数的参数
    //        vTimerCallback); // 定时器回调函数
    //    wifitimer = xTimerCreate("wifiTimer", 50000, pdTRUE, (void *)1, wifibackFunction);
    //    aptimer = xTimerCreate("apTimer", 1000, pdTRUE, (void *)2, wifibackFunction);
    //    // 启动定时器,第二个参数为阻塞时间,这里设置为0,表示不阻塞
    //    xTimerStart(xTimer1, 0);
    //    xTimerStart(wifitimer, 0);
    //    xTimerStart(aptimer, 0);
    //    // 4. 创建任务
    BaseType_t xReturned; // 任务创建返回值变量

    // // 创建LED1任务
    // xReturned = xTaskCreate(
    //     LED1Task,         // 任务主体函数名称
    //     "led1",           // 任务的别名
    //     128,              // 任务站空间  128*4
    //     NULL,             // 任务主体函数传参
    //     1,                // 任务优先级
    //     &Led1TaskHandle); // 任务句柄
    // // 创建LED2任务
    // xReturned = xTaskCreate(LED2Task, "led2", 128, NULL, 1, &Led2TaskHandle);
    // // 创建LED3任务
    // xReturned = xTaskCreate(LED3Task, "led3", 128, NULL, 1, &Led3TaskHandle);
    // // 创建LED4任务
    // xReturned = xTaskCreate(LED4Task, "led4", 128, NULL, 1, &Led4TaskHandle);
    // 创建key任务
    xReturned = xTaskCreate(KeyTask, "key", 128, NULL, 3, &KeyTaskHandle);
    // 创建DHT11任务
    xReturned = xTaskCreate(Dht11Task, "dht11", 256, NULL, 2, &Dht11TaskHandle);
    // // 创建kqm任务
    // xReturned = xTaskCreate(KqmTask, "kqm", 128, NULL, 2, &KqmTaskHandle);
    // // 创建光照任务
    // xReturned = xTaskCreate(LightTask, "light", 128, NULL, 2, &LightTaskHandle);
    // // 创建BH1750任务
    // xReturned = xTaskCreate(Bh1750Task, "bh1750", 128, NULL, 2, &Bh1750TaskHandle);
    // // 创建RTC时间更新任务
    // xReturned = xTaskCreate(RTC_Task, "rtc", 512, NULL, 2, &RTC_TaskHandle);
    // 创建LCD任务
    xReturned = xTaskCreate(LCDTask, "lcd", 512, NULL, 4, &LCDTaskHandle);
    // // 创建wifi任务
    // xReturned = xTaskCreate(WifiTask, "wifi", 512, NULL, 4, &WifiTaskHandle);
    // 创建lvgl任务
    xReturned = xTaskCreate(LVGLTask, "lvgl", 512, NULL, 4, &LVGLTaskHandle);
    // 启动rtos, 开始调度任务.
    vTaskStartScheduler();
}

void vApplicationStackOverflowHook(void)
{
    while (1)
    {
    }
}
// 定义任务时间戳变量 (基于sys_tick_cnt的上次执行时间)
// static uint32_t esp_time = 0;
// static uint32_t reqtime = 0;
// static uint32_t yundatatime = 0;
// static uint32_t rtc_time = 0;
// static uint32_t kqm_time = 0;
// static uint32_t light_time = 0;
// static uint32_t su_03t_time = 0;
// static uint32_t dht11_time = 0;
// static uint32_t bh1750_time = 0;
// static uint32_t printf_time = 0;
// static uint32_t lcd_time = 0;
// static uint32_t gif_time = 0;
// int main(void)
// {
// NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); // 中断分组2（2位抢占+2位子优先级）
// SystemCoreClockUpdate();                        // 更新系统时钟
// SysTick_Config(SystemCoreClock / 1000);         // SysTick=1ms中断

