kushuninan-git/stm32f103zet6RTOS/user/main.c
// 1. 核心外设初始化
// USART1_Init();  // 初始化串口1
// Uart3_Config(); // 初始化串口3 (连接ESP8266)
// TIM_Init();         // 初始化定时器

// 2. 基础硬件初始化
// KEY_Init();   // 初始化按键
// Led_Config(); // 初始化LED

// RGB_Init();   // 初始化RGB LED
// RELAY_Init(); // 初始化继电器
// Bep_Init();   // 初始化蜂鸣器

// 3. 传感器初始化
// Dht11_Init();   // 初始化DHT11温湿度传感器
// Kqm_Init();     // 初始化空气质量传感器
// Light_Config(); // 初始化光照传感器
// Su03t_Init();          // 初始化语音模块
// BH1750_I2C1_Init();    // 硬件初始化BH1750光照传感器
// BH1750_SoftI2C_Init(); // 软件初始化BH1750的I2C接口（二选一）
// BH1750_Sensor_Init();  // 初始化BH1750传感器

//  4. 其他功能初
//  Pwm_Init();     // 初始化PWM
// RTC_Init(); // 初始化RTC
//  Flash_Config(); // 初始化W25Q64芯片
//  LCD_Init();       // 初始化LCD
//  LCD_Clear(BLACK); // 清屏
//  LCD_SetCursor(0, 0); // 设置光标位置
//  LCD_ShowString(0, 0, 128, 16, 16, "Hello World!");
//  LCD_ShowPhoto(0, 16, 240, 240, (uint8_t *)gImage_haimian); // 显示图片
//  LCD_ShowPhoto(3, 3, 20, 19, (uint8_t *)gImage_Icon_wendu);    // 温度
//  LCD_ShowPhoto(3, 26, 20, 19, (uint8_t *)gImage_Icon_shidu);   // 湿度
//  LCD_ShowPhoto(3, 49, 20, 19, (uint8_t *)gImage_Icon_light);   // 光照
//  LCD_ShowPhoto(3, 72, 20, 19, (uint8_t *)gImage_Icon_yanwu);   // 烟感
//  LCD_ShowPhoto(3, 95, 20, 19, (uint8_t *)gImage_Icon_co2);     // CO2
//  LCD_ShowPhoto(3, 118, 20, 19, (uint8_t *)gImage_Icon_ch2o);   // CH2O
//  LCD_ShowPhoto(3, 141, 20, 20, (uint8_t *)gImage_Icon_voc);    // VOC
//  LCD_ShowPhoto(3, 164, 20, 20, (uint8_t *)gImage_Icon_bh1750); // bh1750
//  LCD_ShowChinese(3, 250, 16, (uint8_t *)FONT_ZI_HAO);          // 好
//  LCD_ShowChinese(19, 250, 16, (uint8_t *)FONT_ZI_NI);          // 你

// printf("init ok\r\n");

// // 读取0x123456地址开始 of the 10 bytes
// u8 buff2[10] = {0};
// Flash_ReadData(buff2, 10, 0x123456);
// printf("buff:");

// // 打印buff2数组的内容
// for (u8 i = 0; i < 10; i++)
// {
//     printf("%02X ", buff2[i]);
// }
// printf("\r\n");

// // 擦除0x123456地址开始 of the 4KB sector
// Flash_Delete(0x123456);
// printf("Delete 0x123456 OK\r\n");
// Delay_nms(1000);
// // 再次读取0x123456地址开始 of the 10 bytes
// u8 buff[10] = {0};
// Flash_ReadData(buff, 10, 0x123456);
// printf("buff:");

// // 打印buff数组的内容
// for (u8 i = 0; i < 10; i++)
// {
//     printf("%02X ", buff[i]);
// }
// printf("\r\n");

// // 写数据到0x123456地址开始 of the 10 bytes
// u8 buff1[10] = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A};
// Flash_WriteData(buff1, 10, 0x123456);
// // 读取0x123456地址开始 of the 10 bytes
// Flash_ReadData(buff, 10, 0x123456);
// printf("buff:");
// for (u8 i = 0; i < 10; i++)
// {
//     printf("%02X ", buff[i]);
// }
// printf("\r\n");

// for (u16 i = 0; i < 100; i++)
// {
//     keyflage=KEY_Scan();
//     if(keyflage==KEY1_PRESS){
//         esp.state=1;
//     }
// }

// while (1)
// {

// if ((uint32_t)(sys_tick_cnt - esp_time) >= 100)
// {
//     esp_time = sys_tick_cnt;
//     if (esp.state == 1)
//     {
//         ESP_AP();
//     }
//     else if (esp.state >= 2)
//     {
//         UpDataYun();
//     }
// }
// if ((uint32_t)(sys_tick_cnt - reqtime) >= 50000)
// {
//     reqtime = sys_tick_cnt;
//     if (esp.state == 5)
//         MQTT_REQ();
// }
// // 云数据解析
// if ((uint32_t)(sys_tick_cnt - yundatatime) >= 500)
// {
//     yundatatime = sys_tick_cnt;
//     if (esp.state == 5)
//     {
//         YunDataHandle();
//     }
// }

// 1. 高频任务（500ms）
// RTC时间更新

// if ((uint32_t)(sys_tick_cnt - rtc_time) >= 1000)
// {
//     rtc_time = sys_tick_cnt;
//     RTC_GetTime();
// }

// 空气质量传感器数据更新
// if ((uint32_t)(sys_tick_cnt - kqm_time) >= 500)
// {
//     kqm_time = sys_tick_cnt;
//     Kqm_Data_Analyze();
// }
// 光照传感器数据更新
// if ((uint32_t)(sys_tick_cnt - light_time) >= 500)
// {
//     light_time = sys_tick_cnt;
//     for (u16 i = 0; i < 20; i++)
//     {
//         if (i % 2 == 0)
//         {
//             /* code */
//             printf("light %d\n", addbuff[i]);
//         }
//         else if (i % 2 == 1)
//         {
//             /* code */
//             printf("yanwu %d\n", addbuff[i]);
//         }
//     }
// }

// 2. 中频任务（1000ms）
// 语音模块数据更新
// if ((uint32_t)(sys_tick_cnt - su_03t_time) >= 1000)
// {
//     su_03t_time = sys_tick_cnt;
//     Su03t_Data_Analyze();
// }

// 温湿度传感器数据更新
// if ((uint32_t)(sys_tick_cnt - dht11_time) >= 1000)
// {
//     dht11_time = sys_tick_cnt;
//     Dht11_GetVal();
// }

// 3. 低频任务（2000ms）
// BH1750光照传感器数据更新
// float light;
// if ((uint32_t)(sys_tick_cnt - bh1750_time) >= 2000)
// {
//     bh1750_time = sys_tick_cnt;
//     light = BH1750_Sensor_ReadLight();
//     // printf("BH1750 Light: %.2f lx\r\n", light);
// }
// 传感器数据统一打印
//        if ((uint32_t)(sys_tick_cnt - printf_time) >= 2000)
//        {
//            printf_time = sys_tick_cnt;
//            printf("DHT11: %.2f C, %.2f %%RH\r\n", dht.tem, dht.hum);
//            printf("KQM: CO2: %.2f ppm, CH2O: %.2f ppm, VOC: %.2f ppm\r\n", kqm.co2, kqm.ch2o, kqm.voc);
//            printf("BH1750 Light: %.2f lx\r\n", light);
//            for (u16 i = 0; i < 2; i++)
//            {
//                if (i % 2 == 0)
//                {
//                    /* code */
//                    printf("light %d\n", addbuff[i]);
//                }
//                else if (i % 2 == 1)
//                {
//                    /* code */
//                    printf("yanwu %d\n", addbuff[i]);
//                }
//            }
//      }
// LCD显示更新
// if ((uint32_t)(sys_tick_cnt - lcd_time) >= 2000)
// {
//     lcd_time = sys_tick_cnt;
//     // 显示温度数值在温度图标右侧
//     char temp_str[12];
//     sprintf(temp_str, "%.2f C", dht.tem); // 与实际数据一致，保留两位小数
//     LCD_ShowString(25, 3, 128, 16, 16, (uint8_t *)temp_str);
//
//     // 显示湿度数值在湿度图标右侧
//     char hum_str[12];
//     sprintf(hum_str, "%.2f %%RH", dht.hum); // 与实际数据一致，保留两位小数
//     LCD_ShowString(25, 26, 128, 16, 16, (uint8_t *)hum_str);
//
//     // 显示光照数值在光照图标右侧
//     char light_str[12];
//     sprintf(light_str, "%d", addbuff[0]); // 直接显示ADC原始值
//     LCD_ShowString(25, 49, 128, 16, 16, (uint8_t *)light_str);
//
//     // 显示烟感数值在烟感图标右侧
//     char yanwu_str[12];
//     sprintf(yanwu_str, "%d", addbuff[1]);
//     LCD_ShowString(25, 72, 128, 16, 16, (uint8_t *)yanwu_str);
//
//     // 显示CO2数值在CO2图标右侧
//     char co2_str[12];
//     sprintf(co2_str, "%.2f ppm", kqm.co2); // 与实际数据一致，保留两位小数
//     LCD_ShowString(25, 95, 128, 16, 16, (uint8_t *)co2_str);
//
//     // 显示CH2O数值在CH2O图标右侧
//     char ch2o_str[12];
//     sprintf(ch2o_str, "%.2f ppm", kqm.ch2o); // 与实际数据一致，保留两位小数
//     LCD_ShowString(25, 118, 128, 16, 16, (uint8_t *)ch2o_str);
//
//     // 显示VOC数值在VOC图标右侧
//     char voc_str[12];
//     sprintf(voc_str, "%.2f ppm", kqm.voc); // 与实际数据一致，保留两位小数
//     LCD_ShowString(25, 141, 128, 16, 16, (uint8_t *)voc_str);
//
//     // 显示bh1750数值在bh1750图标右侧
//     char bh1750_str[12];
//     sprintf(bh1750_str, "%.2f lx", light); // 与实际数据一致，保留两位小数
//     LCD_ShowString(25, 164, 128, 16, 16, (uint8_t *)bh1750_str);
// }
// // 5. gif任务（1000ms）
// if ((uint32_t)(sys_tick_cnt - gif_time) >= 10)
// {
//     gif_time = sys_tick_cnt;
//     // 显示gif_1
//     LCD_ShowPhoto(3, 180, 50, 50, (uint8_t *)gImage_gif_1);
//     Delay_nms(100);
//     // 显示gif_2
//     LCD_ShowPhoto(3, 180, 50, 50, (uint8_t *)gImage_gif_2);
//     Delay_nms(100);
//     // 显示gif_3
//     LCD_ShowPhoto(3, 180, 50, 50, (uint8_t *)gImage_gif_3);
//     Delay_nms(100);
//     // 显示gif_4
//     LCD_ShowPhoto(3, 180, 50, 50, (uint8_t *)gImage_gif_4);
//     Delay_nms(100);
// }

